src/Documents/ЗаказНаПроизводство/ЗаказНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаПроизводство</name>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.Долги</registerRecords>
  <attributes>
    <name>НомерДокСбыт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокСбыт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КартаДоставки</name>
    <type>
      <types>CatalogRef.КартыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузкиОбещанная</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутренниеСчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТорговыйДом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисЦентр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтгрузки</name>
    <type>
      <types>EnumRef.ВидыОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоставки</name>
    <type>
      <types>EnumRef.ТипыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Понедельник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вторник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Среда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Четверг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пятница</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Суббота</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Воскресенье</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаРазрешена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРассылки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаПоЗапросу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаказаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВЭД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефоныКонтактногоЛица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СДоверенностью</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьНаКого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьСрок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховочнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантСопровожденияОтгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработанЛогистом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработкиЛогистом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодоваяДоверенность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяПродукция</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВнешнейПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказ</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВЗаказе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезервСвободныйОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезервПерепрогон</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрупныйЗаказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗапуска</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗапусков</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Изменена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РучнойЗапуск</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузкиОбещанная</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВЭД_ВидДокумента</name>
      <type>
        <types>EnumRef.ВЭД_ВидДокумента</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоставкиТовара</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Тара</name>
    <attributes>
      <name>НомерТары</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/СтатусыМПЗ/СтатусыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыМПЗ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСпецификаций</types>
      <types>EnumRef.СтатусыМПЗ</types>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыСпецификаций/СтатусыСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСпецификаций</name>
  <enumValues>
    <name>Серийная</name>
  </enumValues>
  <enumValues>
    <name>Предсерийная</name>
  </enumValues>
  <enumValues>
    <name>Опытная1</name>
  </enumValues>
  <enumValues>
    <name>Опытная</name>
  </enumValues>
  <enumValues>
    <name>ОНР</name>
  </enumValues>
  <enumValues>
    <name>ДоИсчерпанияЗапасов</name>
  </enumValues>
  <enumValues>
    <name>Аналог</name>
  </enumValues>
  <enumValues>
    <name>Запрещённая</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыМПЗ/СтатусыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыМПЗ</name>
  <enumValues>
    <name>Основная</name>
  </enumValues>
  <enumValues>
    <name>ОНР</name>
  </enumValues>
  <enumValues>
    <name>ДоИсчерпанияЗапасов</name>
  </enumValues>
  <enumValues>
    <name>Аналог</name>
  </enumValues>
  <enumValues>
    <name>Неликвид</name>
  </enumValues>
  <enumValues>
    <name>ПроблеммыЛогистики</name>
  </enumValues>
  <enumValues>
    <name>Запрещённая</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыОтгрузки/ВидыОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОтгрузки</name>
  <enumValues>
    <name>Частичная</name>
  </enumValues>
  <enumValues>
    <name>Полная</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Доверенности/Доверенности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Доверенности</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>ДоверенностьДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьСрок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьНаКого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/ЗаказНаПроизводство/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого ТЧ Из Объект.Заказ Цикл
	КоличествоВЗаказе = ТЧ.КоличествоВЗаказе - ОбщийМодульВызовСервера.ПолучитьКорректировкуЗНП(Объект.Ссылка,ТЧ.Продукция);
	СуммаПоЗаказу = СуммаПоЗаказу + ТЧ.Цена*КоличествоВЗаказе;
	КонецЦикла; 
ОбновитьДополнительныеКолонки();
	Если Объект.Закрыт Тогда
	ЭтаФорма.ТолькоПросмотр = Не РольДоступна("Администратор");	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ОбщийМодульВызовСервера.ДоступностьРоли("Отгрузка") Тогда
	Элементы.РезервироватьНеликвиды.Доступность = Ложь;
	Элементы.РезервироватьСвободныеОстатки.Доступность = Ложь;		
	Элементы.ФормаСоздатьПодчиненныйЗНП.Доступность = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РезервироватьНеликвидыНаСервере()
	Для каждого ТЧ Из Объект.Заказ Цикл
	Остаток = ОбщийМодульВызовСервера.ПолучитьНезарезервированныйОстатокПоМестуХранения(Константы.МестоХраненияНеликвидов.Получить(),ТЧ.Продукция,Объект.Дата);
		Если Остаток >= ТЧ.Количество Тогда
		ТЧ.РезервПерепрогон = ТЧ.Количество;
		ТЧ.Количество = 0;
		ИначеЕсли Остаток > 0 Тогда
		ТЧ.РезервПерепрогон = Остаток;
		ТЧ.Количество = ТЧ.Количество - Остаток;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РезервироватьНеликвиды(Команда)
	Если Не Объект.Проведен Тогда
	РезервироватьНеликвидыНаСервере();
	Иначе
	Сообщить("Перед резервированием отмените проведение документа!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РезервироватьСвободныеОстаткиНаСервере()
	Для каждого ТЧ Из Объект.Заказ Цикл
		Если ТипЗнч(ТЧ.Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
		МестоХраненияГП = ТЧ.Продукция.Линейка.МестоХраненияГП;
		Иначе
		//МестоХраненияГП = Константы.МестоХраненияТНП.Получить();
		Продолжить;
		КонецЕсли;
	Остаток = ОбщийМодульВызовСервера.ПолучитьНезарезервированныйОстатокПоМестуХранения(МестоХраненияГП,ТЧ.Продукция,Объект.Дата);
		Если Остаток >= ТЧ.Количество Тогда
		ТЧ.РезервСвободныйОстаток = ТЧ.Количество;
		ТЧ.Количество = 0;
		ИначеЕсли Остаток > 0 Тогда
		ТЧ.РезервСвободныйОстаток = Остаток;
		ТЧ.Количество = ТЧ.Количество - Остаток;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РезервироватьСвободныеОстатки(Команда)
	Если Не Объект.Проведен Тогда
	РезервироватьСвободныеОстаткиНаСервере();
	Иначе
	Сообщить("Перед резервированием отмените проведение документа!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОбновитьДополнительныеКолонки()
	Для каждого ТЧ Из Объект.Заказ Цикл	
		Если ТипЗнч(ТЧ.Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
		ТЧ.Линейка = ТЧ.Продукция.Линейка;
		ТЧ.ВидПродукции = "Производимый";
		ИначеЕсли ТипЗнч(ТЧ.Продукция) = Тип("СправочникСсылка.Материалы") Тогда
		ТЧ.ВидПродукции = "Покупной";
		Иначе
		ТЧ.ВидПродукции = "";	
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеНаСервере()
Возврат(ЭтаФорма.ПроверитьЗаполнение());
КонецФункции

&НаКлиенте
Процедура ТаблицаЗаказаПродукцияПриИзменении(Элемент)
ОбновитьДополнительныеКолонки();
КонецПроцедуры

&НаКлиенте
Функция ПересчитатьКоличествоКПроизводству()
Возврат(Элементы.ТаблицаЗаказа.ТекущиеДанные.КоличествоВЗаказе - Элементы.ТаблицаЗаказа.ТекущиеДанные.РезервСвободныйОстаток - Элементы.ТаблицаЗаказа.ТекущиеДанные.РезервПерепрогон);
КонецФункции

&НаКлиенте
Процедура ТаблицаЗаказаКоличествоВЗаказеПриИзменении(Элемент)
Элементы.ТаблицаЗаказа.ТекущиеДанные.Количество = ПересчитатьКоличествоКПроизводству();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказаРезервСвободныйОстатокПриИзменении(Элемент)
Элементы.ТаблицаЗаказа.ТекущиеДанные.Количество = ПересчитатьКоличествоКПроизводству();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказаРезервПерепрогонПриИзменении(Элемент)
Элементы.ТаблицаЗаказа.ТекущиеДанные.Количество = ПересчитатьКоличествоКПроизводству();
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПродукции(Товар)
СписокПродукции = Новый СписокЗначений;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО СтатусыМПЗСрезПоследних.МПЗ = Номенклатура.Ссылка
	|ГДЕ
	|	Номенклатура.Товар = &Товар
	|	И СтатусыМПЗСрезПоследних.Статус <> &Статус";
Запрос.УстановитьПараметр("Товар",Товар);
Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыСпецификаций.Запрещённая);
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	СписокПродукции.Добавить(Выборка.Ссылка,СокрЛП(Выборка.Ссылка.Наименование));
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	Материалы.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Материалы КАК Материалы
	|		ПО СтатусыМПЗСрезПоследних.МПЗ = Материалы.Ссылка
	|ГДЕ
	|	Материалы.Товар = &Товар
	|	И СтатусыМПЗСрезПоследних.Статус <> &Статус";
Запрос.УстановитьПараметр("Товар",Товар);
Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыМПЗ.Запрещённая);
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	СписокПродукции.Добавить(Выборка.Ссылка,СокрЛП(Выборка.Ссылка.Наименование));
	КонецЦикла;
Возврат(СписокПродукции);
КонецФункции 

&НаКлиенте
Процедура ТаблицаЗаказаПродукцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Элементы.ТаблицаЗаказа.ТекущиеДанные.Товар) Тогда
	СписокПродукции = ПолучитьСписокПродукции(Элементы.ТаблицаЗаказа.ТекущиеДанные.Товар);
		Если СписокПродукции.Количество() > 0 Тогда
		ВыбПродукция = СписокПродукции.ВыбратьЭлемент("Выберите продукцию");
			Если ВыбПродукция <> Неопределено Тогда
			Элементы.ТаблицаЗаказа.ТекущиеДанные.Продукция = ВыбПродукция.Значение;
			ОбновитьДополнительныеКолонки();
			КонецЕсли;
		Иначе
		Сообщить("Товар не привязан ни к одной спецификации или материалу!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокМТК(Продукция)
СписокМТК = Новый СписокЗначений;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутнаяКарта.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
	|ГДЕ
	|	МаршрутнаяКарта.ДокументОснование = &ДокументОснование
	|	И МаршрутнаяКарта.Номенклатура = &Номенклатура";
Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
Запрос.УстановитьПараметр("Номенклатура", Продукция);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокМТК.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
Возврат(СписокМТК);
КонецФункции

&НаСервере
Функция МожноУдалятьМТК(СписокМТК)
	Для каждого МТК Из СписокМТК Цикл 
		Если МТК.Значение.Статус <> 0 Тогда
		Возврат(Ложь);
		КонецЕсли; 
	КонецЦикла;
Возврат(Истина); 	
КонецФункции 

&НаСервере
Функция УдалитьМТК(СписокМТК)
Запрос = Новый Запрос;

	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
		Для каждого МТК Из СписокМТК Цикл 
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПроизводственноеЗадание.Ссылка
			|ИЗ
			|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
			|ГДЕ
			|	ПроизводственноеЗадание.ДокументОснование = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", МТК.Значение);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПЗ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();		
			ПЗ.Удалить();
			КонецЦикла;
		МТКОбъект = МТК.Значение.ПолучитьОбъект();
		МТКОбъект.Удалить();		
		КонецЦикла; 	
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	КонецПопытки;
КонецФункции 

&НаКлиенте
Процедура ТаблицаЗаказаПередУдалением(Элемент, Отказ)
СписокМТК = ПолучитьСписокМТК(Элементы.ТаблицаЗаказа.ТекущиеДанные.Продукция);
	Если СписокМТК.Количество() > 0 Тогда
		Если МожноУдалятьМТК(СписокМТК) Тогда
			Если Вопрос("Удалить связанные МТК?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда	
			УдалитьМТК(СписокМТК);
			Иначе
			Отказ = Истина;
			КонецЕсли;
		Иначе
		Сообщить("Одна из связанных МТК не в статусе ожидания! Удаление невозможно!");
		Отказ = Истина;
		КонецЕсли; 	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДляВнутреннихСчетов()
//Объект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("99999951578");
Объект.ВидОтгрузки = Перечисления.ВидыОтгрузки.Полная;
Объект.Понедельник = Истина;
Объект.Вторник = Истина;
Объект.Среда = Истина;
Объект.Четверг = Истина;
Объект.Пятница = Истина;
Объект.Суббота = Истина;
Объект.Воскресенье = Истина;
Объект.ОтгрузкаРазрешена = Истина;
Объект.ДатаОтгрузки = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ДляСобственныхНуждПриИзменении(Элемент)
	Если Объект.ВнутренниеСчета Тогда	
	ЗаполнитьДляВнутреннихСчетов();
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура СтраницыПриСменеСтраницыНаСервере()
Элементы.Метрика.ТолькоПросмотр = Не РольДоступна("Администратор");
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
СтраницыПриСменеСтраницыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГодоваяДоверенностьПриИзмененииНаСервере()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Доверенности.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Доверенности КАК Доверенности
	|ГДЕ
	|	Доверенности.Владелец = &Владелец
	|	И Доверенности.ДоверенностьСрок >= &ДоверенностьСрок";

Запрос.УстановитьПараметр("Владелец", Объект.Контрагент);
Запрос.УстановитьПараметр("ДоверенностьСрок", ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Объект.ДоверенностьНомер = ВыборкаДетальныеЗаписи.Ссылка.Код;
	Объект.ДоверенностьДата = ВыборкаДетальныеЗаписи.Ссылка.ДоверенностьДата;
	Объект.ДоверенностьСрок = ВыборкаДетальныеЗаписи.Ссылка.ДоверенностьСрок;
	Объект.ДоверенностьНаКого = ВыборкаДетальныеЗаписи.Ссылка.ДоверенностьНаКого;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ГодоваяДоверенностьПриИзменении(Элемент)
	Если Объект.ГодоваяДоверенность Тогда
	ГодоваяДоверенностьПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.ГодоваяДоверенность Тогда
	Доверенность = Справочники.Доверенности.НайтиПоКоду(СокрЛП(Объект.ДоверенностьНомер),,,Объект.Контрагент);	
		Если Доверенность.Пустая() Тогда	
		Доверенность = Справочники.Доверенности.СоздатьЭлемент();
		Доверенность.Владелец = Объект.Контрагент;
		Доверенность.Код = Объект.ДоверенностьНомер;
		Доверенность.ДоверенностьДата = Объект.ДоверенностьДата;
		Доверенность.ДоверенностьСрок = Объект.ДоверенностьСрок;
		Доверенность.ДоверенностьНаКого = Объект.ДоверенностьНаКого;
		Доверенность.Записать();		
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция СоздатьПодчиненныйЗНПНаСервере(Материал,КоличествоВЗаказе)
	Попытка
	ЗаказНаПроизводство = Документы.ЗаказНаПроизводство.СоздатьДокумент();
	ЗаказНаПроизводство.Дата = ТекущаяДата();
	ЗаказНаПроизводство.Автор = ПараметрыСеанса.Пользователь;
	ЗаказНаПроизводство.ДокументОснование = Объект.Ссылка;
	ЗаказНаПроизводство.ВнутренниеСчета = Истина;
	ЗаказНаПроизводство.Контрагент = Справочники.Контрагенты.НайтиПоКоду("1");
	ЗаказНаПроизводство.КартаДоставки = Справочники.КартыДоставки.НайтиПоКоду("000033027");
	ЗаказНаПроизводство.Понедельник = Истина;
	ЗаказНаПроизводство.Вторник = Истина;
	ЗаказНаПроизводство.Среда = Истина;
	ЗаказНаПроизводство.Четверг = Истина;
	ЗаказНаПроизводство.Пятница = Истина;
	ЗаказНаПроизводство.Суббота = Истина;
	ЗаказНаПроизводство.Воскресенье = Истина;
	ЗаказНаПроизводство.ОтгрузкаРазрешена = Истина;
	ЗаказНаПроизводство.ДатаОтгрузки = ТекущаяДата();
	ЗаказНаПроизводство.ЛинейкаУпаковки = 3;
	ЗаказНаПроизводство.ВидОтгрузки = Перечисления.ВидыОтгрузки.Частичная;
	ЗаказНаПроизводство.ВнешняяПродукция = Материал; 
	ЗаказНаПроизводство.КоличествоВнешнейПродукции = КоличествоВЗаказе;

	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НормыРасходовСрезПоследних.Элемент КАК Элемент,
		|	НормыРасходовСрезПоследних.Норма КАК Норма
		|ИЗ
		|	РегистрСведений.НормыРасходов.СрезПоследних(
		|			&НаДату,
		|			Владелец = &Владелец
		|				И Элемент.Товар <> &Товар) КАК НормыРасходовСрезПоследних
		|ГДЕ
		|	НормыРасходовСрезПоследних.Норма > 0
		|	И НормыРасходовСрезПоследних.НормаРасходов.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("Владелец", Материал);
	Запрос.УстановитьПараметр("Товар", Справочники.Товары.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаНР = РезультатЗапроса.Выбрать();
		Пока ВыборкаНР.Следующий() Цикл
		ТЧ_ЗП = ЗаказНаПроизводство.Заказ.Добавить();
		ТЧ_ЗП.Товар = ВыборкаНР.Элемент.Товар;
		ТЧ_ЗП.Продукция = ВыборкаНР.Элемент;
		ТЧ_ЗП.КоличествоВЗаказе = ВыборкаНР.Норма*КоличествоВЗаказе;
		ТЧ_ЗП.Количество = ТЧ_ЗП.КоличествоВЗаказе;
		ТЧ_ЗП.СрокПоставки = ВыборкаНР.Элемент.Товар.СрокПоставки;
		ТЧ_ЗП.ДатаОтгрузкиОбещанная = КалендарныеГрафики.ПолучитьДатуПоКалендарю(Константы.ОсновнойПроизводственныйКалендарь.Получить(),ЗаказНаПроизводство.Дата,ТЧ_ЗП.СрокПоставки);
		ЗаказНаПроизводство.ДатаОтгрузкиОбещанная = Макс(ЗаказНаПроизводство.ДатаОтгрузкиОбещанная,ТЧ_ЗП.ДатаОтгрузкиОбещанная);
			Если ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.Номенклатура") Тогда
			КоличествоНеликвиды = ОбщийМодульВызовСервера.ПолучитьНезарезервированныйОстатокПоМестуХранения(Константы.МестоХраненияНеликвидов.Получить(),ТЧ_ЗП.Продукция,ТекущаяДата());
				Если КоличествоНеликвиды > 0 Тогда						
					Если ТЧ_ЗП.Количество <= КоличествоНеликвиды Тогда
					ТЧ_ЗП.РезервПерепрогон = ТЧ_ЗП.Количество;
					ТЧ_ЗП.Количество = 0;
					Иначе
					ТЧ_ЗП.РезервПерепрогон = КоличествоНеликвиды;
					ТЧ_ЗП.Количество = ТЧ_ЗП.Количество - КоличествоНеликвиды;							
					КонецЕсли;
				КонецЕсли;
			КоличествоСвободныйОстаток = ОбщийМодульВызовСервера.ПолучитьНезарезервированныйОстатокПоМестуХранения(ТЧ_ЗП.Продукция.Линейка.МестоХраненияГП,ТЧ_ЗП.Продукция,ТекущаяДата());
				Если КоличествоСвободныйОстаток > 0 Тогда						
					Если ТЧ_ЗП.Количество <= КоличествоСвободныйОстаток Тогда
					ТЧ_ЗП.РезервСвободныйОстаток = ТЧ_ЗП.Количество;
					ТЧ_ЗП.Количество = 0;
					Иначе
					ТЧ_ЗП.РезервСвободныйОстаток = КоличествоСвободныйОстаток;
					ТЧ_ЗП.Количество = ТЧ_ЗП.Количество - КоличествоСвободныйОстаток;							
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	ЗаказНаПроизводство.Записать(РежимЗаписиДокумента.Проведение);
	Возврат(ЗаказНаПроизводство.Ссылка);
	Исключение
	Сообщить(ОписаниеОшибки());	
	КонецПопытки;
Возврат(Неопределено);
КонецФункции

&НаСервере
Функция ПолучитьСписокМатериалов(Продукция)
СписокМатериалов = Новый СписокЗначений;

ВыборкаНР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_М(Продукция,ТекущаяДата());
	Пока ВыборкаНР.Следующий() Цикл
	СписокМатериалов.Добавить(ВыборкаНР.Элемент);
	КонецЦикла;
Возврат(СписокМатериалов);
КонецФункции
 
&НаКлиенте
Процедура СоздатьПодчиненныйЗНП(Команда)
СписокМатериалов = ПолучитьСписокМатериалов(Элементы.ТаблицаЗаказа.ТекущиеДанные.Продукция);
	Если СписокМатериалов.Количество() > 0 Тогда
	ВыбМатериал = СписокМатериалов.ВыбратьЭлемент("Выберите материал");
		Если ВыбМатериал <> Неопределено Тогда
		ЗНП = СоздатьПодчиненныйЗНПНаСервере(ВыбМатериал.Значение,Элементы.ТаблицаЗаказа.ТекущиеДанные.КоличествоВЗаказе);
			Если ЗНП <> Неопределено Тогда
			ОткрытьФорму("Документ.ЗаказНаПроизводство.ФормаОбъекта",Новый Структура("Ключ",ЗНП));
			КонецЕсли; 	
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
